# St7SetLoadCaseDefaults

Sets the defaults for the specified load case in a Strand7 model; not applicable to seismic load cases.

long St7SetLoadCaseDefaults(long uID, long CaseNum, double* Defaults)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Load case number.
Defaults[0..12]
[ipLoadCaseRefTemp] – Reference temperature.
[ipLoadCaseOrigX, ipLoadCaseOrigY, ipLoadCaseOrigZ] – Origin for angular velocity and
acceleration.
[ipLoadCaseAccX, ipLoadCaseAccY, ipLoadCaseAccZ] – Linear acceleration components.
[ipLoadCaseAngVelX, ipLoadCaseAngVelY, ipLoadCaseAngVelZ] – Angular velocity
components.
[ipLoadCaseAngAccX, ipLoadCaseAngAccY, ipLoadCaseAngAccZ] – Angular acceleration
components.